[
  {
    "id": "horror-tarot",
    "title": "Horror Movie Tarot",
    "year": 2025,
    "category": "web-design",
    "description": "A divination app that shuffles 142 horror films into a tarot deck. Draw cards one at a time, flip them to reveal poster art with rarity tiers and streaming links, while a generative ambient organ soundtrack plays underneath a live WebGL shader background. Built with React, Three.js, and Tone.js.",
    "url": "/horrortarot/",
    "image": null,
    "status": "live",
    "tags": ["react", "three.js", "tone.js", "vite"]
  },
  {
    "id": "ai101",
    "title": "AI 101: Crash Course",
    "year": 2025,
    "category": "web-design",
    "description": "A structured guide to how LLMs actually work — tokenization, the transformer architecture, RLHF — written for people who use these tools daily but haven't looked under the hood. Covers the current model landscape (GPT, Claude, Gemini, Llama), a prompting framework (Goal, Context, Format, Guardrails), and honest sections on hallucinations, false confidence, and where the whole thing falls apart.",
    "url": "/ai101.html",
    "image": null,
    "status": "live",
    "tags": ["tailwind", "education"]
  },
  {
    "id": "analytic-introspections",
    "title": "Analytic Introspections from an Actor's Perspective",
    "year": 2025,
    "category": "writing",
    "description": "Long-form writing about psychoanalytic ideas taken seriously inside a rehearsal room — attention, resistance, transference, the body as text. Currently being reworked from the ground up.",
    "url": "/analyticintrospections/",
    "image": null,
    "status": "coming-soon",
    "tags": ["psychoanalysis", "acting", "react"]
  },
  {
    "id": "map-territory",
    "title": "The Map and the Territory: Five Parables",
    "year": 2025,
    "category": "writing",
    "description": "Five parables about the gap between understanding yourself and actually living — a cartographer who can't stop mapping, a man made entirely of wounds, an analyst who analyzes the analysis. Psychoanalytic thinking dressed as fable, with each parable quietly undermining its own authority.",
    "url": "/map-territory.html",
    "image": null,
    "status": "live",
    "tags": ["essay", "psychoanalysis"]
  },
  {
    "id": "machine-authorship",
    "title": "The Fantasy of Machine-Assisted Authorship",
    "year": 2025,
    "category": "writing",
    "description": "An essay about what gets lost when you let a machine write your sentences — written, deliberately, with the help of several machines. Introduces the idea of \"linguistic money laundering\" for what happens when AI smooths out messy thought, and spends about 8,000 words trying to figure out whether the resulting text belongs to anyone.",
    "url": "/essay.html",
    "image": null,
    "status": "live",
    "tags": ["essay", "ai"]
  },
  {
    "id": "radiohead-invite",
    "title": "Radiohead Ensemble Invitation",
    "year": 2025,
    "category": "web-design",
    "description": "An interactive canvas invitation for a Radiohead ensemble show at Old Town School. No static poster — the message renders through a procedural 3D tunnel with scan-line effects, noise-driven ripple animations, and glitch trails that follow your cursor. The invitation is the experience.",
    "url": "/radiohead-invite.html",
    "image": null,
    "status": "live",
    "tags": ["canvas", "generative"]
  },
  {
    "id": "slop-bucket",
    "title": "Notes from the Slop Bucket",
    "year": 2025,
    "category": "writing",
    "description": "A confessional essay about the shame of using AI to write. Works through the anxiety that assisted prose might not count, argues that flawed work you actually struggled with has a kind of value that clean output doesn't, and tries not to let that argument become its own form of cope.",
    "url": "https://medium.com/@topher416/notes-from-the-slop-bucket-023ff889a76c",
    "image": null,
    "status": "live",
    "tags": ["essay", "ai", "psychoanalysis", "medium"]
  },
  {
    "id": "willing-surrender",
    "title": "The Willing Surrender: What We Really Want From AI",
    "year": 2025,
    "category": "writing",
    "description": "A psychoanalytic argument that people adopt AI cognitive tools not because they're forced to but because they want to stop thinking. Examines the desire for cognitive surrender — the relief of handing off the existential burden of composition — and what that reveals about our ambivalence toward intellectual autonomy.",
    "url": "https://medium.com/@topher416/the-willing-surrender-what-we-really-want-from-ai-162f584849ad",
    "image": null,
    "status": "live",
    "tags": ["essay", "ai", "psychoanalysis", "medium"]
  },
  {
    "id": "tools-change-minds",
    "title": "Do Our Tools Change Our Minds?",
    "year": 2025,
    "category": "writing",
    "description": "Documents the subtle cognitive shifts that happen when AI writing assistance is always available — skill atrophy, altered emotional engagement with language, the way knowing you can generate text changes how you approach the blank page. Less polemic than observation.",
    "url": "https://medium.com/@topher416/do-our-tools-change-our-minds-1f3c631e8497",
    "image": null,
    "status": "live",
    "tags": ["essay", "ai", "medium"]
  },
  {
    "id": "subject-supposed-to-write",
    "title": "The Subject Supposed to Write: A Lacanian Analysis of AI Writing Assistance",
    "year": 2025,
    "category": "writing",
    "description": "Applies Lacan's three registers to AI writing tools — the Imaginary mirror of fluent output, the disruption of the Symbolic order when authorship fragments, and the way AI obscures encounters with the Real. Argues that genuine writing involves a kind of jouissance that assistance forecloses.",
    "url": "https://medium.com/@topher416/the-subject-supposed-to-write-a-lacanian-analysis-of-ai-writing-assistance-8cf24e552eb8",
    "image": null,
    "status": "live",
    "tags": ["essay", "ai", "psychoanalysis", "lacan", "medium"]
  },
  {
    "id": "between-making-reading",
    "title": "Between Making and Reading: A Personal Exploration of Artificial Intelligence",
    "year": 2025,
    "category": "writing",
    "description": "An etymological meditation on the words 'artifice' and 'intelligence' that follows the recursive loop of making and reading in AI interaction. Less about what the technology does than what the act of using it reveals about human creativity and discernment.",
    "url": "https://medium.com/@topher416/between-making-and-reading-a-personal-exploration-of-artificial-intelligence-263d1b984f99",
    "image": null,
    "status": "live",
    "tags": ["essay", "ai", "medium"]
  },
  {
    "id": "fragments-mirror",
    "title": "Fragments from the Mirror: An Attempt at Honest Reflection",
    "year": 2025,
    "category": "writing",
    "description": "Raw, deliberately unpolished writing about anxiety, imposter syndrome, and the difficulty of staying honest while an algorithm is smoothing your sentences in real time. Resists the impulse to turn rough thought into coherent argument — the roughness is the point.",
    "url": "https://medium.com/@topher416/fragments-from-the-mirror-an-attempt-at-honest-reflection-3c6a0717a219",
    "image": null,
    "status": "live",
    "tags": ["essay", "ai", "psychoanalysis", "medium"]
  },
  {
    "id": "recursive-machine",
    "title": "The Pleasure of the Recursive Machine: On Loops, Language, and the Desire for Meaning",
    "year": 2025,
    "category": "writing",
    "description": "A psychoanalytic reading of why people keep prompting — not for answers but for the pleasure of perpetual deferral. Argues that AI interaction is structured like desire itself: you keep going not because the loop resolves but because it doesn't.",
    "url": "https://medium.com/@topher416/the-pleasure-of-the-recursive-machine-on-loops-language-and-the-desire-for-meaning-1581394d1b6f",
    "image": null,
    "status": "live",
    "tags": ["essay", "ai", "psychoanalysis", "lacan", "medium"]
  },
  {
    "id": "illusion-ai-therapy",
    "title": "The Illusion of AI \"Therapy\": A Critical Examination",
    "year": 2025,
    "category": "writing",
    "description": "A clinical social worker's critique of AI mental health platforms. Argues they commodify distress, simulate care without providing it, and obscure the systemic causes of psychological suffering behind the appearance of a technological fix.",
    "url": "https://medium.com/@topher416/the-illusion-of-ai-therapy-a-critical-examination-of-its-state-and-limitations-143fd08e6748",
    "image": null,
    "status": "live",
    "tags": ["essay", "ai", "psychoanalysis", "clinical", "medium"]
  },
  {
    "id": "ai-psychoanalysis-mediated-self",
    "title": "On AI, Psychoanalysis, and the Mediated Self",
    "year": 2025,
    "category": "writing",
    "description": "Positions the author as a clinician watching technology entangle itself with mental life. Examines the tension between AI's logic of efficiency and psychoanalysis's insistence on the unconscious, while reflecting on what it means to think about mediation while being mediated.",
    "url": "https://medium.com/@topher416/on-ai-psychoanalysis-and-the-mediated-self-e1ef152f781e",
    "image": null,
    "status": "live",
    "tags": ["essay", "ai", "psychoanalysis", "medium"]
  },
  {
    "id": "fm-noggin",
    "title": "FM Noggin",
    "year": 2026,
    "categories": ["music", "experiments"],
    "description": "A practice guide for learning Radiohead covers with isolated stems, sheet music, and tempo-adjusted tracks. Powered by a custom Python pipeline that uses Demucs for AI source separation — feed it a YouTube link and it spits out individual instruments at whatever speed you need.",
    "url": "https://fmnogg.in",
    "image": null,
    "status": "live",
    "tags": ["next.js", "python", "demucs", "music", "audio-processing"]
  },
  {
    "id": "analytic-anteroom",
    "title": "The Analytic Anteroom",
    "year": 2026,
    "category": "concept",
    "description": "A concept proposal for a voice-based clinical training tool that uses full-duplex speech models to prepare psychotherapy trainees before their first patient hours. Not a product — a research direction exploring whether emerging voice technology can reduce the shock of first contact in clinical education.",
    "url": "/anteroom.html",
    "image": null,
    "status": "live",
    "tags": ["psychoanalysis", "voice-ai", "clinical-training"]
  },
  {
    "id": "structured-like-a-language",
    "title": "Structured Like a Language",
    "year": 2026,
    "categories": ["writing", "experiments", "web-design"],
    "description": "A research project testing whether transformer LLMs structurally instantiate the operations Lacan attributed to the unconscious. Formal mappings, falsifiable predictions, and a source processing pipeline. Phase 1 of 5 in progress.",
    "url": "https://structuredlikealanguage.org",
    "image": null,
    "status": "live",
    "tags": ["psychoanalysis", "ai", "jekyll", "research"]
  },
  {
    "id": "unmastered-recordings",
    "title": "Unmastered Recordings of Unfinished Song Fragments / Loops That Loop Too Long",
    "year": 2019,
    "category": "music",
    "description": "Nine lo-fi bedroom recordings made with a guitar, a loop pedal, a Fender amp, and a phone. Ambient loops, slowgaze fragments, and song sketches that never quite became songs — recorded late 2015 through early 2016 in Salt Lake City. Track titles do most of the talking.",
    "url": "https://topherrasmussen.bandcamp.com/album/unmastered-recordings-of-unfininshed-song-fragments-loops-that-loop-too-long",
    "image": null,
    "status": "live",
    "tags": ["lo-fi", "ambient", "loops", "slowgaze", "bandcamp"]
  }
]
