[
  {
    "id": "horror-tarot",
    "title": "Horror Movie Tarot",
    "year": 2025,
    "category": "web-design",
    "description": "A divination app that shuffles 142 horror films into a tarot deck. Draw cards one at a time, flip them to reveal poster art with rarity tiers and streaming links, while a generative ambient organ soundtrack plays underneath a live WebGL shader background. Built with React, Three.js, and Tone.js.",
    "url": "/horrortarot/",
    "image": null,
    "status": "live",
    "tags": ["react", "three.js", "tone.js", "vite"]
  },
  {
    "id": "ai101",
    "title": "AI 101: Crash Course",
    "year": 2025,
    "category": "web-design",
    "description": "A structured guide to how LLMs actually work — tokenization, the transformer architecture, RLHF — written for people who use these tools daily but haven't looked under the hood. Covers the current model landscape (GPT, Claude, Gemini, Llama), a prompting framework (Goal, Context, Format, Guardrails), and honest sections on hallucinations, false confidence, and where the whole thing falls apart.",
    "url": "/ai101.html",
    "image": null,
    "status": "live",
    "tags": ["tailwind", "education"]
  },
  {
    "id": "analytic-introspections",
    "title": "Analytic Introspections from an Actor's Perspective",
    "year": 2025,
    "category": "writing",
    "description": "Long-form writing about psychoanalytic ideas taken seriously inside a rehearsal room — attention, resistance, transference, the body as text. Currently being reworked from the ground up.",
    "url": "/analyticintrospections/",
    "image": null,
    "status": "coming-soon",
    "tags": ["psychoanalysis", "acting", "react"]
  },
  {
    "id": "map-territory",
    "title": "The Map and the Territory: Five Parables",
    "year": 2025,
    "category": "writing",
    "description": "Five parables about the gap between understanding yourself and actually living — a cartographer who can't stop mapping, a man made entirely of wounds, an analyst who analyzes the analysis. Psychoanalytic thinking dressed as fable, with each parable quietly undermining its own authority.",
    "url": "/map-territory.html",
    "image": null,
    "status": "live",
    "tags": ["essay", "psychoanalysis"]
  },
  {
    "id": "machine-authorship",
    "title": "The Fantasy of Machine-Assisted Authorship",
    "year": 2025,
    "category": "writing",
    "description": "An essay about what gets lost when you let a machine write your sentences — written, deliberately, with the help of several machines. Introduces the idea of \"linguistic money laundering\" for what happens when AI smooths out messy thought, and spends about 8,000 words trying to figure out whether the resulting text belongs to anyone.",
    "url": "/essay.html",
    "image": null,
    "status": "live",
    "tags": ["essay", "ai"]
  },
  {
    "id": "radiohead-invite",
    "title": "Radiohead Ensemble Invitation",
    "year": 2025,
    "category": "web-design",
    "description": "An interactive canvas invitation for a Radiohead ensemble show at Old Town School. No static poster — the message renders through a procedural 3D tunnel with scan-line effects, noise-driven ripple animations, and glitch trails that follow your cursor. The invitation is the experience.",
    "url": "/radiohead-invite.html",
    "image": null,
    "status": "live",
    "tags": ["canvas", "generative"]
  },
  {
    "id": "fm-noggin",
    "title": "FM Noggin",
    "year": 2026,
    "categories": ["music", "experiments"],
    "description": "A practice guide for learning Radiohead covers with isolated stems, sheet music, and tempo-adjusted tracks. Powered by a custom Python pipeline that uses Demucs for AI source separation — feed it a YouTube link and it spits out individual instruments at whatever speed you need.",
    "url": "https://fmnogg.in",
    "image": null,
    "status": "live",
    "tags": ["next.js", "python", "demucs", "music", "audio-processing"]
  },
  {
    "id": "analytic-anteroom",
    "title": "The Analytic Anteroom",
    "year": 2026,
    "category": "concept",
    "description": "A concept proposal for a voice-based clinical training tool that uses full-duplex speech models to prepare psychotherapy trainees before their first patient hours. Not a product — a research direction exploring whether emerging voice technology can reduce the shock of first contact in clinical education.",
    "url": "/anteroom.html",
    "image": null,
    "status": "live",
    "tags": ["psychoanalysis", "voice-ai", "clinical-training"]
  },
  {
    "id": "structured-like-a-language",
    "title": "Structured Like a Language",
    "year": 2026,
    "categories": ["writing", "experiments", "web-design"],
    "description": "A research project testing whether transformer LLMs structurally instantiate the operations Lacan attributed to the unconscious. Formal mappings, falsifiable predictions, and a source processing pipeline. Phase 1 of 5 in progress.",
    "url": "https://structuredlikealanguage.org",
    "image": null,
    "status": "live",
    "tags": ["psychoanalysis", "ai", "jekyll", "research"]
  }
]
